{
  "\t\t": 47818,
  "\t\t\t": 47817,
  "\t\t\t\t": 47816,
  "\t\t\t\t\t": 47815,
  "\t\t\t\t\t\t": 47814,
  "\t\t\t\t\t\t\t": 47813,
  "\t\t\t\t\t\t\t\t": 47812,
  "\t\t\t\t\t\t\t\t\t": 47811,
  "  ": 47810,
  "   ": 47809,
  "    ": 47808,
  "     ": 47807,
  "      ": 47806,
  "       ": 47805,
  "        ": 47804,
  "         ": 47803,
  "          ": 47802,
  "           ": 47801,
  "            ": 47800,
  "             ": 47799,
  "              ": 47798,
  "               ": 47797,
  "                ": 47796,
  "                 ": 47795,
  "                  ": 47794,
  "                   ": 47793,
  "                    ": 47792,
  "                     ": 47791,
  "                      ": 47790,
  "                       ": 47789,
  "                        ": 47788,
  "                         ": 47787,
  "                          ": 47786,
  "                           ": 47785,
  "                            ": 47784,
  "                             ": 47783,
  "                              ": 47782,
  "                               ": 47781,
  "<|endoftext|>": 47780
}
